/* 1. Написать функцию, преобразующую число в объект. Передавая на вход число от 0 до 999,
надо получить на выходе объект, в котором в соответствующих свойствах описаны единицы,
десятки и сотни. Например, для числа 245 надо получить следующий объект: {‘единицы’: 5,
‘десятки’: 4, ‘сотни’: 2}​ . Если число превышает 999, необходимо выдать соответствующее
сообщение с помощью ​ console.log​ и вернуть пустой объект.  */

function numberInObject(num) {
	var obj = {};
	if (num < 1 || num > 999 || isNaN(num)) {
		alert('Ошибка. Введите число от 1 до 999');
		return obj;
	} else {
		obj['едининцы'] = num % 10;
		obj['десятки'] = (num - obj['едининцы']) % 100 / 10;
		obj['сотни'] = (num - obj['едининцы'] - obj['десятки'] * 10) % 1000 / 100;
		return obj;
	}
}


var a = prompt('Введите число от 0 до 999');
console.log(numberInObject(a));